var flippedchars = new Array(
		// Lower case
		'a', 'ɐ', 'ɐ', 'a',
		'b', 'q', 'q', 'b',
		'c', 'ɔ', 'ɔ', 'c',
		'd', 'p', 'p', 'd',
		'e', 'ǝ', 'ǝ', 'e',
		'f', 'ɟ', 'ɟ', 'f',
		'g', 'ɓ', 'ɓ', 'g',
		'h', 'ɥ', 'ɥ', 'h',
		'i', 'ı', 'ı', 'i',
		'j', 'ɾ', 'ɾ', 'j',
		'k', 'ʞ', 'ʞ', 'k',
		'm', 'ɯ', 'ɯ', 'm',
		'n', 'u', 'u', 'n',
		'p', 'd', 'd', 'p',
		'q', 'b', 'b', 'q',
		'r', 'ɹ', 'ɹ', 'r',
		't', 'ʇ', 'ʇ', 't',
		'u', 'n', 'n', 'u',
		'v', 'ʌ', 'ʌ', 'v',
		'w', 'ʍ', 'ʍ', 'w',
		'y', 'ʎ', 'ʎ', 'y',

		// Upper case
		'A', '∀', '∀', 'A',
		'B', '𐐒', '𐐒', 'B',
		'C', 'Ɔ', 'Ɔ', 'C',
		'D', 'ᗡ', 'ᗡ', 'D',
		'E', 'Ǝ', 'Ǝ', 'E',
		'F', 'Ⅎ', 'Ⅎ', 'F',
		'G', '⅁', '⅁', 'G',
		'J', 'ſ', 'ſ', 'J',
		'K', '⋊', '⋊', 'K',
		'L', '⅂', '⅂', 'L',
		'M', 'W', 'W', 'M',
		'P', 'Ԁ', 'Ԁ', 'P',
		'Q', 'Ό', 'Ό', 'Q',
		'R', 'ᴚ', 'ᴚ', 'R',
		'T', '⊥', '⊥', 'T',
		'U', '∩', '∩', 'U',
		'V', 'Λ', 'Λ', 'V',
		'W', 'M', 'M', 'W',
		'Y', '⅄', '⅄', 'Y',

		// Punctuation and other symbols
		';',  '؛',  '؛',   ';',
		',',  '\'', '\'', ',',
		'.',  '˙',  '˙',  '.',
		'"',  '„',  '„',  '"',
		'!',  '¡',  '¡',  '!',
		'?',  '¿',  '¿',  '?',
		'_',  '‾',  '‾',  '_',
		'&',  '⅋',  '⅋',  '&',
		'(',  ')',  ')',  '('
	);

window.getFlipped = function(chr) {
	for (i = 0; i < flippedchars.length; i++) {
		if (i % 2 == 0 && flippedchars[i] == chr)
			return flippedchars[i+1];
	}
	return chr;
}