var flippedchars = new Array(
		// Lower case
		'a', 'ɐ', 'a',
		'b', 'q', 'b',
		'c', 'ɔ', 'c',
		'd', 'p', 'd',
		'e', 'ǝ', 'e',
		'f', 'ɟ', 'f',
		'g', 'ɓ', 'g',
		'h', 'ɥ', 'h',
		'i', 'ı', 'i',
		'j', 'ɾ', 'j',
		'k', 'ʞ', 'k',
		'm', 'ɯ', 'm',
		'n', 'u', 'n',
		'p', 'd', 'p',
		'q', 'b', 'q',
		'r', 'ɹ', 'r',
		't', 'ʇ', 't',
		'u', 'n', 'u',
		'v', 'ʌ', 'v',
		'w', 'ʍ', 'w',
		'y', 'ʎ', 'y',

		// Upper case
		'A', '∀', 'A',
		'B', '𐐒', 'B',
		'C', 'Ɔ', 'C',
		'D', 'ᗡ', 'D',
		'E', 'Ǝ', 'E',
		'F', 'Ⅎ', 'F',
		'G', '⅁', 'G',
		'J', 'ſ', 'J',
		'K', '⋊', 'K',
		'L', '⅂', 'L',
		'M', 'W', 'M',
		'P', 'Ԁ', 'P',
		'Q', 'Ό', 'Q',
		'R', 'ᴚ', 'R',
		'T', '⊥', 'T',
		'U', '∩', 'U',
		'V', 'Λ', 'V',
		'W', 'M', 'W',
		'Y', '⅄', 'Y',

		// Punctuation and other symbols
		';',  '؛',  ';',
		',',  '\'', ',',
		'.',  '˙',  '.',
		'"',  '„',  '"',
		'!',  '¡',  '!',
		'?',  '¿',  '?',
		'_',  '‾',  '_',
		'&',  '⅋',  '&',
		'(',  ')',  '(',
		'[',  ']',  '[',
		'{',  '}',  '{',
		'<',  '>',  '<'
	);

window.getFlipped = function(chr) {
	var i = flippedchars.indexOf(chr);
	if (i == -1) {
		return chr;
	}
	return flippedchars[i+1];
}